Revit 2024 API
EdgeEndPoint.Edge Property
 The Edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Edge Edge { get; }
Visual Basic
Public ReadOnly Property Edge As Edge
	Get
Visual C++
public:
property Edge^ Edge {
	Edge^ get ();
}
See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace